
<div class="sql-query">
<center><b>Список изменений:</b></center>
</div>

<div class="sql-query" style="padding: 5px;">
<br>

_________________________<br>
<b>06.07.2015</b> - v 4.8
<ul> 
	<li>
		Полный редизайн сайта: внедрение адаптивного дизайна, поправки под планшеты и телефоны; подготовка к переходу на движок TosLib-ng
	</li>
</ul>
_________________________<br>
<b>06.07.2014</b> - v 4.7.1
<ul> 
	<li>
	Теперь профили можно редактировать: поддерживается базовая разметка. Основные ф-ции уже написаны - осталось лишь расширить.
	</li>
</ul>
_________________________<br>
<b>03.07.2014</b> - v 4.7
<ul>
Начальная поддержка профилей: 
	<li>
	Можно посмотреть ник, имя, дату последнего посещения; ручное изменение данных будет введено в последующих версиях.
	</li>
</ul>
_________________________<br>
<b>01.07.2014</b> - v 4.6.14
<ul>
	<li>
	Сортировка ников пользователей в чате по алфавиту; ники неактивных пользователей сортируются под активными.
	</li>
</ul>

_________________________<br>
<b>30.06.2014</b> - v 4.6.13
<ul>
	<li>
	Изменения в безопасности: чат теперь не обновляется, если пользователь был удален или кто-то другой зашёл с его учётной записи. В этой же ситуации в чат невозможно отправить сообщение. В соответствие с вышесказанным, пользователь также удаляется из списка таковых в чате. Алгоритм проверки длинный, так что обо всех ошибках просьба сообщать администратору <b>Zeben</b>.
	</li>
</ul>
_________________________<br>
<b>30.06.2014</b> - v 4.6.12
<ul>
	<li>
	добавлена функция просмотра списка изменений, дополняется с помощью редактирования файла (лень запиливать функционал в админку)
	</li>
</ul>

_________________________<br>
<b>10.06.2014</b> - v 4.6
<ul>
	<li>
	Перезагрузка репозитория. Добавлен чат:
	<ul>
		<li>
			хайлайтинг
		</li>
		<li>
			bb-коды
		</li>
		<li>
			автозамена ссылок
		</li>
		<li>
			отключен тег Img
		</li>
		<li>
			проверка на существование юзера в БД
		</li>
		<li>
			переключение юзера в readonly при удалении учётки юзера
		</li>
		<li>
			частично пофикшен "невидимый юзер"
		</li>
	</ul>
	</li>
</ul>

_________________________<br>
<b>22.05.2014</b> - v 4.5.1

<ul>
	<li>
	пофиксил отображение контента на IE версий 8-7-6 - офигеть о_О.
	</li>
	<li>
	обновил глобальное меню - теперь оно адаптируется под мобильные телефоны.
	</li>
</ul>



_________________________<br>
<b>24.05.2014</b> - v 4.5

<ul>
	<li>
	исправлены некоторые ошибки в новой системе редиректов сообщений, добавлена пачка костылей.
	</li>
	<li>
	теперь при добавлении раздела/каталога/записи редиректит в созданный раздел/каталог с записью.
	</li>
</ul>
_________________________<br>
<b>25.06.2014</b> - v 4.4.1
<ul>
	<li>
	изменена организация главного меню - статические пункты вынесены в статическую панель
	</li>
</ul>
_________________________<br>
<b>25.05.2014</b> - v 4.4
<ul>
	<li>
	добавлено меню навигации для главной страницы, поиска, меню категорий и меню материалов
	</li>
</ul>
Список будет дополняться.
</div>
